app/controllers/movies_controller.rb

  def index
    @order = params[:order] || session[:order]
    case @order
    when 'title'
      sort, title = {:order => :title}
    when 'release_date'
      sort, release_date = {:order => :release_date}
    end
    @all_ratings = Movie.all_ratings
    @ratings_selected = params[:ratings] || session[:ratings] || {}

    if @ratings_selected == {}
      @ratings_selected = Hash[@all_ratings.map {|rating| [rating, rating]}]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date